In [ ]:
import pandas as pd

# Задание 7
При помощи Python и SQL найдите, как называются ваши города в таблице City базы данных World-db (строка подключения аналогично лекции - postgresql://netology:NetoSQL2019@84.201.153.170:19001/world-db.
Создайте соответствующий справочник на отдельном листе Google-таблиц
Добавьте колонку с английским названием города

In [ ]:
df = pd.read_sql(
"""
SELECT
  *
FROM
  city
WHERE
  name = 'Tallinn'
""",
"postgresql://netology:NetoSQL2019@84.201.153.170:19001/world-db"
)

df.head()

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

     id     name country_code  district  population
0  3791  Tallinn          EST  Harjumaa      403981

# Задание 8 и 9
При помощи SQL и Python получите датафрейм с названием города и его населением из таблицы City

In [ ]:
df_open = pd.read_csv('Планирование отпусков - Данные.csv',sep=',')
df_open.head()

      Отметка времени  ... Английское название
0  2/25/2021 13:49:09  ...            Istanbul
1  2/25/2021 13:50:18  ...              Moscow
2  2/25/2021 13:52:32  ...           Krasnodar
3  2/25/2021 13:54:58  ...             Bangkok
4  2/25/2021 13:55:54  ...           Barcelona

[5 rows x 14 columns]

In [ ]:
df_small = pd.read_sql(
"""
SELECT
  name, population
FROM
  city
""",
"postgresql://netology:NetoSQL2019@84.201.153.170:19001/world-db"
)

df_small.head()

             name  population
0           Kabul     1780000
1        Qandahar      237500
2           Herat      186800
3  Mazar-e-Sharif      127800
4       Amsterdam      731200

# Задание 10
При помощи Python соедините данные из выгруженного CSV файла (пункт 8) и таблицы с населением города
Сгруппируйте итоговый датафрейм по странам и рассчитайте среднюю численность населения в городах, в которых вы отдыхали

In [ ]:
df_merged = df_open.merge(df_small, left_on='Английское название', right_on='name', how='inner')
df_merged.head()

      Отметка времени  Страна:  ...       name population
0  2/25/2021 13:49:09   Турция  ...   Istanbul    8787958
1  2/25/2021 13:50:18   Россия  ...     Moscow    8389200
2  2/25/2021 13:52:32   Россия  ...  Krasnodar     639000
3  2/25/2021 13:54:58  Тайланд  ...    Bangkok    6320174
4  2/25/2021 13:55:54  Испания  ...  Barcelona    1503451

[5 rows x 16 columns]

In [ ]:
df_merged1 = df_merged[['Страна:','Город:','population']]
df_merged1.groupby('Страна:').mean()

          population
Страна:
Германия     3386667
Испания       912859
Латвия        764328
Россия       4514100
Тайланд      6320174
Турция       8787958
Франция      2125246
Эстония       403981
Япония       7980230